# ๐ ุณูุงุฑู ุณูู: ุฏุณุชุฑุณ ุงุฒ ุฑุงู ุฏูุฑ (Remote Access - Telnet & SSH)

ุฏุฑ ุงู ุณูุงุฑูุ ูุญููโ ูพฺฉุฑุจูุฏ ุฏุณุชุฑุณ ุงุฒ ุฑุงู ุฏูุฑ ุจู ุณูุฆฺ ุงุฒ ุทุฑู Telnet ู SSH ุฑุง ุจุฑุฑุณ ูโฺฉูู.

---

## ๐งช ูุฏู ุณูุงุฑู

- ุฑุงูโุงูุฏุงุฒ ุฏุณุชุฑุณ ุจู ุฏุณุชฺฏุงู ุณุณฺฉู ุงุฒ ุฑุงู ุฏูุฑ ุจุง Telnet ู SSH  
- ุงุนูุงู ูุญุฏูุฏุช ุจุฑุง ูพูุฑุชโูุง VTY  
- ุชุนุฑู ฺฉุงุฑุจุฑุงู ุจุง ุณุทูุญ ุฏุณุชุฑุณ ูุฎุชูู  
- ุฑูุฒูฺฏุงุฑ ูพุณูุฑุฏูุง  
- ุชุณุช ุงุชุตุงู ุงุฒ ฺฉุงููพูุชุฑ ฺฉูุงูุช  

---

## ๐ ุจุฎุด ุงูู: ุฏุณุชุฑุณ ุจุง Telnet

### ๐งพ ูพฺฉุฑุจูุฏ ฺฉู

```bash
Switch> enable
Switch# configure terminal
Switch(config)# username admin privilege 15 secret P@ssWord
Switch(config)# username guest privilege 0 secret guest
Switch(config)# enable secret EnPass
Switch(config)# service password-encryption
```

---

### ๐ ูพฺฉุฑุจูุฏ ุฎุทูุท VTY ุจุฑุง Telnet

```bash
Switch(config)# line vty 0 15
Switch(config-line)# transport input none
Switch(config-line)# exit

Switch(config)# line vty 0 3
Switch(config-line)# transport input telnet
Switch(config-line)# no login
Switch(config-line)# login local
Switch(config-line)# exec-timeout 3 30
Switch(config-line)# exit
```

---

### ๐ ุชูุธู ุขุฏุฑุณ IP ุฑู VLAN1

```bash
Switch(config)# interface vlan 1
Switch(config-if)# ip address 192.168.10.100 255.255.255.0
Switch(config-if)# no shutdown
Switch(config-if)# exit
```

---

### ๐ป ุชูุธูุงุช ฺฉูุงูุช ุจุฑุง Telnet

- IP ฺฉูุงูุช: `192.168.10.10/24`  
- ุฏุฑ ุชุฑููุงู ฺฉุงููพูุชุฑ ูุงุฑุฏ ฺฉูุฏ:

```bash
telnet 192.168.10.100
```

---

## ๐ ุจุฎุด ุฏูู: ุฏุณุชุฑุณ ุจุง SSH

### ๐งพ ูพฺฉุฑุจูุฏ ฺฉู

```bash
Switch> enable
Switch# configure terminal
Switch(config)# username admin privilege 15 secret P@ssWord
Switch(config)# username guest privilege 0 secret guest
Switch(config)# enable secret EnPass
Switch(config)# service password-encryption
```

---

### ๐ ูพฺฉุฑุจูุฏ ุฎุทูุท VTY ุจุฑุง SSH

```bash
# (none)ุจุฑุง ุงููุช ุจุดุชุฑ ุงุจุชุฏุง ุชูุงู ูุงู ูุงุฑุง ูุจูุฏู

Switch(config)# line vty 0 15
Switch(config-line)# transport input none
Switch(config-line)# exit

Switch(config)# line vty 0 3
Switch(config-line)# transport input ssh
Switch(config-line)# no login
Switch(config-line)# login local
Switch(config-line)# exec-timeout 3 30
Switch(config-line)# exit
```

---

### ๐ท ุชูุธู ุฏุงููู ู ุชููุฏ ฺฉูุฏ RSA

```bash
Switch(config)# hostname sw
sw(config)# ip domain-name smaple.local
sw(config)# crypto key generate rsa
```

> ๐ ุชูุฌู: ููฺฏุงู ุชููุฏ ฺฉูุฏุ ุณุงุฒ 1024 ุง ุจุงูุงุชุฑ ุฑุง ูุงุฑุฏ ฺฉูุฏ.

---

### ๐ ุชูุธู IP ุจุฑุง VLAN1

```bash
sw(config)# interface vlan 1
sw(config-if)# ip address 192.168.10.100 255.255.255.0
sw(config-if)# no shutdown
sw(config-if)# exit
```

---

### ๐ป ุชูุธูุงุช ฺฉูุงูุช ุจุฑุง SSH

- IP ฺฉูุงูุช: `192.168.10.10/24`  
- ุฏุณุชูุฑ ุงุชุตุงู:

```bash
ssh -l admin 192.168.10.100
# ุง
ssh admin@192.168.10.100
```

---

## ๐ ููุงุณู ฺฉู Telnet ู SSH

| ูฺฺฏ         | Telnet           | SSH                 |
|---------------|------------------|---------------------|
| ุฑูุฒูฺฏุงุฑ     | โ ูุฏุงุฑุฏ         | โ ุฏุงุฑุฏ             |
| ุงููุช        | โฌ ูพุงูโุชุฑ       | โฌ ุจุงูุงุชุฑ           |
| ูพูุฑุช ูพุดโูุฑุถ | 23               | 22                  |
| ุชูุตูโุดุฏู     | ุฎุฑ              | ุจูู                 |

---

ุจุง ูพฺฉุฑุจูุฏ ูุฑ ุฏู ุฑูุด ูโุชูุงูุฏ ุชูุงูุชโูุง ุนูู ุงููุช ู ฺฉุงุฑุจุฑ ุขูโูุง ุฑุง ุชุฌุฑุจู ฺฉุฑุฏู ู ุชุตูู ุจฺฏุฑุฏ ฺฉุฏุงู ุฑูุด ููุงุณุจโุชุฑ ุงุณุช.
