# ๐จ ุณูุงุฑู ูพูุฌู: ูพฺฉุฑุจูุฏ VLAN (Virtual LAN)

ุฏุฑ ุงู ุณูุงุฑู ุจุง ููููู VLANุ ุฏูู ุงุณุชูุงุฏู ุงุฒ ุขูุ ุชูุงูุช ุขู ุจุง VLSMุ ู ุฑูุด ูพฺฉุฑุจูุฏ ุขู ุฑู ุณูุฆฺ ุขุดูุง ูโุดูู.

---

## โ ฺุฑุง VLANุ

ุฏุฑ ุดุจฺฉูโูุง ุจุฒุฑฺฏุ ูููโ ุณุณุชูโูุง ุจู ุทูุฑ ูพุดโูุฑุถ ุฏุฑ ฺฉ broadcast domain ูุฑุงุฑ ุฏุงุฑูุฏ. ุงู ุนู:

- ุชุฑุงูฺฉ broadcast ุจู ูููโ ูพูุฑุชโูุง ุงุฑุณุงู ูโุดูุฏ  
- ุงููุช ูพุงู ุงุณุช  
- ฺฉูุชุฑู ู ูุฏุฑุช ุณุฎุชโุชุฑ ูโุดูุฏ  

### โ ุฑุงูโุญู: VLAN

VLAN ุจู ูุง ุงู ุงูฺฉุงู ุฑุง ูโุฏูุฏ ฺฉู **ุฏุฑ ุณุทุญ ูุงู ฒ (ููฺฉ ุฏุชุง)** ุดุจฺฉูโูุง ูุฌุงุฒ ูุฌุฒุง ุจุณุงุฒูุ ุจูโุทูุฑโฺฉู ุฏุณุชฺฏุงูโูุง ุฏุฑ VLANูุง ูุฎุชูู ุญุช ุงฺฏุฑ ุจู ฺฉ ุณูุฆฺ ูุชุตู ุจุงุดูุฏุ **ุจุง ูู ุงุฑุชุจุงุท ูุณุชูู ูุฏุงุดุชู ุจุงุดูุฏ.**

---

## ๐ ุชูุงูุช VLAN ุจุง VLSM

| ูฺฺฏ             | VLAN                                 | VLSM                          |
|------------------|--------------------------------------|-------------------------------|
| ูุงู ฺฉุงุฑ         | ูุงู ฒ (Data Link)                   | ูุงู ณ (Network)              |
| ูุฏู              | ุฌุฏุงุณุงุฒ ููุทู ุฏุณุชฺฏุงูโูุง              | ุชูุณู ุฏูู ุขุฏุฑุณโูุง IP       |
| Broadcast Domain | ฺูุฏ Broadcast Domain ุงุฌุงุฏ ูโฺฉูุฏ    | ุฑู Broadcast ุงุซุฑ ูุฏุงุฑุฏ     |
| ุงุณุชูุงุฏู          | ุฑู ุณูุฆฺ                            | ุฑู ุฑูุชุฑ ุง ุฏุฑ ุทุฑุงุญ ุขุฏุฑุณโุฏู |

---

## โ๏ธ ูุฑุงุญู ูพฺฉุฑุจูุฏ VLAN

### ๐งพ ุงุฌุงุฏ VLANูุง

```bash
Switch> enable
Switch# configure terminal

Switch(config)# vlan 10
Switch(config-vlan)# name sale
Switch(config-vlan)# exit

Switch(config)# vlan 20
Switch(config-vlan)# name management
Switch(config-vlan)# exit
```

---

### ๐ง ุชุฎุตุต ูพูุฑุชโูุง ุจู VLAN

#### ูพูุฑุชโูุง 1 ุชุง 3 โ VLAN 10 (ูุฑูุด)

```bash
Switch(config)# interface range fastEthernet 0/1 - 3
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport access vlan 10
Switch(config-if-range)# exit
```

#### ูพูุฑุชโูุง 4 ุชุง 6 โ VLAN 20 (ูุฏุฑุช)

```bash
Switch(config)# interface range fastEthernet 0/4 - 6
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport access vlan 20
Switch(config-if-range)# exit
```

---

## ๐งช ุจุฑุฑุณ VLANูุง

ุจุฑุง ูุดุงูุฏู ูุถุนุช VLANูุง ู ูพูุฑุชโูุง ูุฑุจูุทู:

```bash
Switch# show vlan brief
```

---

## ๐ก ูฺฉุงุช ุชฺฉูู

- VLANูุง ูุงูโ ุฏูู ุฑุง ูุฏุฑุช ูโฺฉููุฏุ ุงูุง ุจุฑุง ุงุฑุชุจุงุท ุจู ุขูโูุง ุจู ุฑูุชุฑ ุง ุณูุฆฺ ูุงู ณ ูุงุฒ ุฏุงุฑุฏ (Inter-VLAN Routing).
- ุจุง VLAN ูโุชูุงู ุดุจฺฉู ุฑุง ุงุฒ ูุธุฑ ุนููฺฉุฑุฏุ ุงููุช ู ูุฏุฑุช ุจูุจูุฏ ุฏุงุฏ.
- ุจุฏูู VLANุ ุชูุงู ุฏุณุชฺฏุงูโูุง ุดุจฺฉู ุฏุฑ ฺฉ broadcast domain ุจุงู ูโูุงููุฏ.

---

ุจุง ุงุณุชูุงุฏู ุงุฒ VLANุ ูโุชูุงู ุดุจฺฉูโุง ููุทูุ ุงูู ู ููุนุทู ุณุงุฎุช ฺฉู ุจุฑุงุณุงุณ ูุงุฒูุง ุณุงุฒูุงู ุชูุณูโุจูุฏ ุดุฏู ุจุงุดุฏ.
